DataProcessors/ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеСведение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновнаяЯчейка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТМ_СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ТТМ_СкладскиеЯчейки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТТМ_СкладскиеЯчейки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Склады</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПроверитьЯчейкуВСправочнике(КодСклада, Ячейка);
	КодЭлемента = КодСклада + "-" + Ячейка;
	СсылкаНаЯчейку = Справочники.СкладскиеЯчейки.НайтиПоКоду(КодЭлемента);
	Если СсылкаНаЯчейку <> Справочники.СкладскиеЯчейки.ПустаяСсылка() Тогда 
		Возврат СсылкаНаЯчейку;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
	
&НаСервереБезКонтекста
Функция ПолучитьТаблицуНоменклатурыДляОбработки(ДополнительноеСведение)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Объект КАК Номенклатура,
	               |	ДополнительныеСведения.Свойство КАК Свойство,
	               |	ДополнительныеСведения.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |ГДЕ
	               |	ДополнительныеСведения.Свойство = &ДополнительноеСведение";   
	Запрос.УстановитьПараметр("ДополнительноеСведение",ДополнительноеСведение);
	ТабНоменклатура = Запрос.Выполнить().Выгрузить();
	Возврат ТабНоменклатура;
КонецФункции

&НаСервереБезКонтекста 
Процедура СоздатьСкладскуюЯчейку(Склад,КодСклада,НомерЯчейки)
	Ячейка = Справочники.СкладскиеЯчейки.СоздатьЭлемент();
	Ячейка.Код = СокрЛП(КодСклада) + "-" + СокрЛП(НомерЯчейки);			//ПолучитьКод(ДанныеЯчейки.КодСклада);  
	Ячейка.Наименование = СокрЛП(КодСклада) + "-" + СокрЛП(НомерЯчейки); 	//ДанныеЯчейки.Код;
	Ячейка.Владелец = Склад;  
	Ячейка.Секция = КодСклада;
	Ячейка.Стеллаж = НомерЯчейки;
	Ячейка.Записать();	
КонецПроцедуры      

&НаСервереБезКонтекста
Процедура СоздатьЯчейкиНаСервере(Склад,Код,Номенклатура = Неопределено, ДополнительноеСведение)   
	Если не ЗначениеЗаполнено(Номенклатура) Тогда 
		ТабНоменклатуры = ПолучитьТаблицуНоменклатурыДляОбработки(ДополнительноеСведение);	
		Для Каждого СтрТаб из ТабНоменклатуры Цикл
			ДанныеЯчейки = ПолучитьДанныеЯчейкиИзНоменклатуры(СтрТаб.Номенклатура,ДополнительноеСведение);
			//КодЯчейки = ДанныеЯчейки.КодСклада + "-" + ДанныеЯчейки.Ячейка;
			Если не ДанныеЯчейки = Неопределено Тогда  
				//КодЯчейки = СтрТаб.Значение;
				ДобавитьЯчейку = ПроверитьЯчейкуВСправочнике(ДанныеЯчейки.КодСклада, ДанныеЯчейки.Ячейка); 
				Если ДобавитьЯчейку = Неопределено Тогда 
					СоздатьСкладскуюЯчейку(Склад,ДанныеЯчейки.КодСклада,ДанныеЯчейки.Ячейка);
				Иначе 
					Сообщить("Ячейка "+СтрТаб.Значение+" уже существует!");
				КонецЕсли;
			Иначе 
				Сообщить("Невозможно создать ячейку, так как отсутствуют сведения о месте хранения! " + Номенклатура);
			КонецЕсли;
		КонецЦикла;
	Иначе              
		ДанныеЯчейки = ПолучитьДанныеЯчейкиИзНоменклатуры(Номенклатура,ДополнительноеСведение);   
		КодЯчейки = ДанныеЯчейки.КодСклада + "-" + ДанныеЯчейки.Ячейка;
		ДобавитьЯчейку = ПроверитьЯчейкуВСправочнике(ДанныеЯчейки.КодСклада, ДанныеЯчейки.Ячейка);
		Если ДобавитьЯчейку = Неопределено Тогда 
			СоздатьСкладскуюЯчейку(Склад,ДанныеЯчейки.КодСклада,ДанныеЯчейки.Ячейка);	
		Иначе 
			Сообщить("Ячейка "+КодЯчейки+" уже существует!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры    

&НаКлиенте
Процедура СоздатьЯчейку(Команда)
	СоздатьЯчейкиНаСервере(Объект.Склад,Объект.КодСклада,Объект.Номенклатура, Объект.ДополнительноеСведение);
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьДанныеЯчейкиИзНоменклатуры(Номенклатура, ДополнительноеСведение)
	
	ДанныеЯчейки = Новый Структура("КодСклада, Ячейка");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Объект КАК Объект,
	               |	ДополнительныеСведения.Свойство КАК Свойство,
	               |	ДополнительныеСведения.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |ГДЕ
	               |	ДополнительныеСведения.Свойство = &ДополнительноеСведение
	               |	И ДополнительныеСведения.Объект = &Номенклатура";
	Запрос.УстановитьПараметр("ДополнительноеСведение",ДополнительноеСведение);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Если не Запрос.Выполнить().Пустой() Тогда 
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();  
		МестоХранения = Выборка.Значение;
		ДанныеЯчейки.КодСклада = Лев(МестоХранения,СтрНайти(МестоХранения,"-")-1);
		ДанныеЯчейки.Ячейка = Прав(МестоХранения,СтрДлина(МестоХранения)-СтрНайти(МестоХранения,"-"));
		Возврат ДанныеЯчейки;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура НоменклатураПриИзмененииНаСервере(Номенклатура, ДополнительноеСведение)
	ПолучитьДанныеЯчейкиИзНоменклатуры(Номенклатура, ДополнительноеСведение);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере(Объект.Номенклатура, Объект.ДополнительноеСведение);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьРегистрРазмещенияНоменклатурыНаСервере(ДополнительноеСведение, Склад) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Объект КАК Номенклатура,
	               |	ДополнительныеСведения.Свойство КАК Свойство,
	               |	ЕСТЬNULL(ТТМ_СкладскиеЯчейки.Ссылка, ЗНАЧЕНИЕ(Справочник.ТТМ_СкладскиеЯчейки.ПустаяСсылка)) КАК Ячейка,
	               |	&Склад КАК Склад,
	               |	ИСТИНА КАК ОсновнаяЯчейка        
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТТМ_СкладскиеЯчейки КАК ТТМ_СкладскиеЯчейки
	               |		ПО ((ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(7))) = ТТМ_СкладскиеЯчейки.Код)
	               |ГДЕ
	               |	ДополнительныеСведения.Свойство = &ДополнительноеСведение";
	Запрос.УстановитьПараметр("ДополнительноеСведение",ДополнительноеСведение);
	Запрос.УстановитьПараметр("Склад",Склад);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрТЗ из ТЗ Цикл
		//СоздатьЯчейкиНаСервере(Склад,КодСклада,,ДополнительноеСведение);
		НЗ = РегистрыСведений.ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьНаборЗаписей();
		НЗ.Отбор.Номенклатура.Установить(СтрТЗ.Номенклатура);
		НЗ.Отбор.Склад.Установить(Склад);
		//НЗ.Отбор.Ячейка = СтрТЗ.Ячейка;
		НЗ.Прочитать();
		Если НЗ.Количество() <1 Тогда 
			НоваяЗапись = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрТЗ);
		ИначеЕсли НЗ.Количество() = 1 Тогда  
			Для Каждого СтрНЗ из НЗ Цикл 
				ЗаполнитьЗначенияСвойств(СтрНЗ,СтрТЗ);
				Прервать;
			КонецЦикла;                            
		Иначе
			//Если НЗ.Количество() > 1 Тогда  
			Сообщить("Найдено более 1 ячейки для номенклатуры " + СтрТЗ.Номенклатура);
		КонецЕсли;
		НЗ.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРегистрРазмещенияНоменклатуры(Команда)
	ПроверитьСоздатьЯчейки(Объект.Номенклатура, Объект.ДополнительноеСведение, Объект.Склад);
	ЗаполнитьРегистрРазмещенияНоменклатурыНаСервере(Объект.ДополнительноеСведение,Объект.Склад);
КонецПроцедуры  

&НаСервереБезКонтекста
Процедура ПроверитьСоздатьЯчейки(Номенклатура, ДополнительноеСведение, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Объект КАК Номенклатура,
	               |	ДополнительныеСведения.Свойство КАК Свойство,
	               |	ДополнительныеСведения.Значение КАК ДС_НомерЯчейки,
	               |	ЕСТЬNULL(ТТМ_СкладскиеЯчейки.Ссылка, ЗНАЧЕНИЕ(Справочник.ТТМ_СкладскиеЯчейки.ПустаяСсылка)) КАК Ячейка
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТТМ_СкладскиеЯчейки КАК ТТМ_СкладскиеЯчейки
	               |		ПО ((ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(7))) = ТТМ_СкладскиеЯчейки.Код)
	               |ГДЕ
	               |	ДополнительныеСведения.Свойство = &ДополнительноеСведение";
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда 
		Запрос.Текст = Запрос.Текст + " И ДополнительныеСведения.Объект = &Номенклатура";
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	КонецЕсли;       
	Запрос.УстановитьПараметр("ДополнительноеСведение",ДополнительноеСведение);
	ТабЯчейкиНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрТЗ из ТабЯчейкиНоменклатуры Цикл 
		Если не ЗначениеЗаполнено(СтрТЗ.Ячейка) Тогда  
			Если Справочники.ТТМ_СкладскиеЯчейки.НайтиПоКоду(СтрТЗ.ДС_НомерЯчейки) = Справочники.ТТМ_СкладскиеЯчейки.ПустаяСсылка() Тогда 
				НомерЯчейки = СтрТЗ.ДС_НомерЯчейки;        
				ПозицияРазделителя = СтрНайти(НомерЯчейки,"-");
				
				ОбъектЯчейка = Справочники.ТТМ_СкладскиеЯчейки.СоздатьЭлемент();
				ОбъектЯчейка.Владелец = Склад;
				ОбъектЯчейка.Код = СтрТЗ.ДС_НомерЯчейки;
				ОбъектЯчейка.Наименование = ОбъектЯчейка.Код;
				ОбъектЯчейка.КодСклада = Лев(СтрТЗ.ДС_НомерЯчейки,2);
				ОбъектЯчейка.НомерЯчейки = Сред(НомерЯчейки,ПозицияРазделителя+1,СтрДлина(НомерЯчейки)-ПозицияРазделителя);
				Попытка 
					ОбъектЯчейка.Записать();
					Сообщить("Ячейка создана " + НомерЯчейки + " для номенклатуры " + СтрТЗ.Номенклатура);
				Исключение
					Сообщить("Ошибка записи ячейки " + НомерЯчейки + " для номенклатуры " + СтрТЗ.Номенклатура);
				КонецПопытки;
			КонецЕсли;
		//Иначе 
			//Сообщить("Ячейка создана " + НомерЯчейки + " для номенклатуры " + СтрТЗ.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПолучитьКод(КодСклада,НомерЯчейки)
//	РазделительСтрока = "-";	
//	
//	Адрес = СокрЛП(КодСклада) +РазделительСтрока+ СокрЛП(НомерЯчейки);
//			//+ СокрЛП(Объект.Линия)
//			//+ ?(ПустаяСтрока(Объект.Линия), "", РазделительСтрока)
//			//+ ?(ПустаяСтрока(Объект.Стеллаж), "", РазделительСтрока)
//			//+ СокрЛП(Объект.Ярус) 
//			//+ ?(ПустаяСтрока(Объект.Ярус), "", РазделительСтрока)
//			//+ СокрЛП(Объект.Позиция);
//	//Если Прав(Адрес, 1) = РазделительСтрока Тогда
//	//	Адрес = Лев(Адрес, СтрДлина(Адрес)-1);
//	//КонецЕсли;
//КонецФункции
